infra-resume.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-22 Wed 10:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Oleg Sivokon" />
<meta name="description" content="My resume"
 />
<meta name="keywords" content="Resume, job, employment, cv" />
</head>
<body>
<div id="content">
<div class="org-center">
<p>
Oleg Sivokon
</p>

<p>
Born June 23, 1978
</p>

<p>
+972 (0) 544-563314
</p>

<p>
<a href="mailto:olegsivokon@gmail.com">mailto:olegsivokon@gmail.com</a>
</p>

<p>
Eilat 13, Apt. 5, Givatayim, Israel
</p>

<p>
<i>You can find an up-to-date electronic resume at</i>
</p>

<p>
<a href="https://github.com/wvxvw/resume">https://github.com/wvxvw/resume</a>
</p>
</div>

<div id="outline-container-org05a6a91" class="outline-2">
<h2 id="org05a6a91">Technology Skills</h2>
<div class="outline-text-2" id="text-org05a6a91">
</div>
<div id="outline-container-org8a98442" class="outline-3">
<h3 id="org8a98442">Languages</h3>
<div class="outline-text-3" id="text-org8a98442">
<p>
My current work is in Go, Python and Bash.
</p>

<p>
Other languages I programmed in: Java, C, JavaScript, Erlang.
</p>

<p>
Expert in Common Lisp, and Prolog.  Some knowledge of Clojure.
</p>

<p>
Wrote several Emacs Lisp packages.
</p>
</div>
</div>

<div id="outline-container-org946b849" class="outline-3">
<h3 id="org946b849">Programming Environment</h3>
<div class="outline-text-3" id="text-org946b849">
<p>
In my current job, I work extensively with Linux, Docker,
Kubernetes, Apache Kafka and VCenter.  I am proficient with variety
of build systems, several databases, and various UNIX tools needed
to maintain infrastructure of a big programming workshop running.
I set up and run Jenkins jobs, Elastic Search tools, Docker
Registry and Etcd distributed database.
</p>

<p>
I have substantial knowledge of Git and of a variety of tools that
aid in writing quality code such as linters, unit test frameworks,
formatters etc.
</p>

<p>
Recently, I had to work with numerical and statistical Python
packages: NumPy, Pandas and Dask.  I also have experience working
with popular Python frameworks: Django, Tornado, Pytest.
</p>
</div>
</div>
</div>

<div id="outline-container-org352ee4d" class="outline-2">
<h2 id="org352ee4d">Work History</h2>
<div class="outline-text-2" id="text-org352ee4d">
</div>
<div id="outline-container-orgbbf182f" class="outline-3">
<h3 id="orgbbf182f">NEX Traiana</h3>
<div class="outline-text-3" id="text-orgbbf182f">
<dl class="org-dl">
<dt>Programmer</dt><dd>August 2017&#x2013;present
<ul class="org-ul">
<li>Wrote tools for automating microservice deployment, debugging
and testing.</li>
</ul></dd>
</dl>
</div>
</div>

<div id="outline-container-orgb4ec660" class="outline-3">
<h3 id="orgb4ec660">AllAspect</h3>
<div class="outline-text-3" id="text-orgb4ec660">
<dl class="org-dl">
<dt>Programmer</dt><dd>April 2017&#x2013;August 2017
<ul class="org-ul">
<li>Wrote tools for automatic trading in digital media market.</li>
<li>Wrote tools for reporting, representing and processing of
statistical data.</li>
</ul></dd>
</dl>
</div>
</div>

<div id="outline-container-orgcaf9568" class="outline-3">
<h3 id="orgcaf9568">Elastifile</h3>
<div class="outline-text-3" id="text-orgcaf9568">
<dl class="org-dl">
<dt>Programmer</dt><dd>December 2015&#x2013;April 2017
<ul class="org-ul">
<li>Rewrote the build system of the infrastructure part of the
project.</li>
<li>Wrote NFS client for testing the company's product.</li>
<li>Wrote ``glue'' code that allowed automated testing code to
interface with system code.</li>
</ul></dd>
</dl>
</div>
</div>

<div id="outline-container-org2506c06" class="outline-3">
<h3 id="org2506c06">PowToon Ltd.</h3>
<div class="outline-text-3" id="text-org2506c06">
<dl class="org-dl">
<dt>Programmer</dt><dd>January 2014&#x2013;May 2015
<ul class="org-ul">
<li>Rewrote the major application component (the player).</li>
<li>Wrote most of the infrastructure code such as build scripts,
automated test generation and continuous integration server
setup.</li>
<li>Wrote several designs for the product.</li>
</ul></dd>
</dl>
</div>
</div>

<div id="outline-container-org6588bfe" class="outline-3">
<h3 id="org6588bfe">TransGaming Inc.</h3>
<div class="outline-text-3" id="text-org6588bfe">
<dl class="org-dl">
<dt>Programmer</dt><dd>April 2013&#x2013;2013
<ul class="org-ul">
<li>Wrote a game portal for ``Smart TV'' deployment.</li>
<li>Wrote a tester program, which stress-tested the program
performance on ``Smart TV''.</li>
<li>Wrote automated build for my project.</li>
<li>Wrote a sizable chunk of code dealing with usage statistic
aggregation using Google Analytics.</li>
</ul></dd>
</dl>
</div>
</div>

<div id="outline-container-orgfe488e1" class="outline-3">
<h3 id="orgfe488e1">Rounds</h3>
<div class="outline-text-3" id="text-orgfe488e1">
<dl class="org-dl">
<dt>Programmer</dt><dd>December 2010&#x2013;August 2011
<ul class="org-ul">
<li>Rewrote the communication part of the video chat application.</li>
<li>Wrote a testing server and utility programs for automated
testing.</li>
<li>Wrote a natural language processing program which was used
to advertise the company's product.</li>
</ul></dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-org1de14d5" class="outline-2">
<h2 id="org1de14d5">University Level Courses</h2>
<div class="outline-text-2" id="text-org1de14d5">
<p>
Data Scientist's Toolbox (statistics in R), Statistics, Data
Analysis, Machine Learning, Artificial Intelligence.
</p>
</div>
</div>

<div id="outline-container-org5d346f6" class="outline-2">
<h2 id="org5d346f6">Volunteering And Community Work</h2>
<div class="outline-text-2" id="text-org5d346f6">
<p>
SCons project, ActionScript plugin.  (SCons is an extensible build system
written in Python).
</p>

<p>
For several years I was a member of Adobe Community Board. I moderated a forum
dedicated to Flash and ActionScript as well as writing some articles such as
this one: <a href="http://kb2.adobe.com/community/publishing/526/cpsid_52670.html">http://kb2.adobe.com/community/publishing/526/cpsid_52670.html</a>
</p>

<p>
I'm an active member of Emacs Q/A site from the StackExchange family.
</p>
</div>
</div>

<div id="outline-container-org31b08d6" class="outline-2">
<h2 id="org31b08d6">Examples Of My Work</h2>
<div class="outline-text-2" id="text-org31b08d6">
<p>
My Github profile:
</p>
<ul class="org-ul">
<li><a href="https://github.com/wvxvw/">https://github.com/wvxvw/</a>.</li>
<li><a href="https://github.com/wvxvw-traiana/">https://github.com/wvxvw-traiana/</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-orgaacaf96" class="outline-2">
<h2 id="orgaacaf96">Languages</h2>
<div class="outline-text-2" id="text-orgaacaf96">
<p>
Fluent in English, Hebrew, Russian.
</p>
</div>
</div>

<div id="outline-container-org5f6f79d" class="outline-2">
<h2 id="org5f6f79d">Hobbies</h2>
<div class="outline-text-2" id="text-org5f6f79d">
<p>
NLP, Computational linguistics, Moral philosophy, General AI, Graphs.
</p>
</div>
</div>

<div id="outline-container-org6103bb3" class="outline-2">
<h2 id="org6103bb3">Citizenship and Mobility</h2>
<div class="outline-text-2" id="text-org6103bb3">
<p>
Citizen of Israel and Ukraine.  USA citizenship pending.  Willing
to relocate.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2017-02-23 Thu 00:00</p>
<p class="author">Author: Oleg Sivokon</p>
<p class="date">Created: 2018-08-22 Wed 10:49</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
