infra-resume.tex
% Created 2018-06-15 Fri 13:19
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage[utf8]{inputenc}
\usepackage[scaled]{helvet}
\usepackage[a4paper, total={7in, 9in}]{geometry}
\renewcommand*\familydefault{\sfdefault}
\author{Oleg Sivokon}
\date{\textit{<2017-02-23>}}
\title{}
\hypersetup{
  pdfkeywords={Resume, job, employment, cv},
  pdfsubject={My resume},
  pdfcreator={Emacs 25.3.1 (Org mode 8.2.10)}}
\begin{document}


\begin{center}
Oleg Sivokon

Born June 23, 1978

+972 (0) 544-563314

\url{mailto:olegsivokon@gmail.com}

Eilat 13, Apt. 5, Givatayim, Israel \\[18pt]

\small \emph{You can find an up-to-date electronic resume at}

\url{https://github.com/wvxvw/resume} \\[48pt]
\end{center}

\section*{Technology Skills}
\label{sec-1}
\subsection*{Languages}
\label{sec-1-1}
My current work is in Go, Python and Bash.

Other languages I programmed in: Java, C, JavaScript, Erlang.

Expert in Common Lisp, and Prolog.  Some knowledge of Clojure.

Wrote several Emacs Lisp packages.

\subsection*{Programming Environment}
\label{sec-1-2}
In my current job, I work extensively with Linux, Docker,
Kubernetes, Apache Kafka and VCenter.  I am proficient with variety
of build systems, several databases, and various UNIX tools needed
to maintain infrastructure of a big programming workshop running.
I set up and run Jenkins jobs, Elastic Search tools, Docker
Registry and Etcd distributed database.

I have substantial knowledge of Git and of a variety of tools that
aid in writing quality code such as linters, unit test frameworks,
formatters etc.

Recently, I had to work with numerical and statistical Python
packages: NumPy, Pandas and Dask.  I also have experience working
with popular Python frameworks: Django, Tornado, Pytest.

\section*{Work History}
\label{sec-2}

\subsection*{NEX Traiana}
\label{sec-2-1}
\begin{description}
\item[{Programmer}] August 2017--present
\begin{itemize}
\item Wrote tools for automating microservice deployment, debugging
and testing.
\end{itemize}
\end{description}

\subsection*{AllAspect}
\label{sec-2-2}
\begin{description}
\item[{Programmer}] April 2017--August 2017
\begin{itemize}
\item Wrote tools for automatic trading in digital media market.
\item Wrote tools for reporting, representing and processing of
statistical data.
\end{itemize}
\end{description}

\subsection*{Elastifile}
\label{sec-2-3}
\begin{description}
\item[{Programmer}] December 2015--April 2017
\begin{itemize}
\item Rewrote the build system of the infrastructure part of the
project.
\item Wrote NFS client for testing the company's product.
\item Wrote ``glue'' code that allowed automated testing code to
interface with system code.
\end{itemize}
\end{description}

\subsection*{PowToon Ltd.}
\label{sec-2-4}
\begin{description}
\item[{Programmer}] January 2014--May 2015
\begin{itemize}
\item Rewrote the major application component (the player).
\item Wrote most of the infrastructure code such as build scripts,
automated test generation and continuous integration server
setup.
\item Wrote several designs for the product.
\end{itemize}
\end{description}

\subsection*{TransGaming Inc.}
\label{sec-2-5}
\begin{description}
\item[{Programmer}] April 2013--2013
\begin{itemize}
\item Wrote a game portal for ``Smart TV'' deployment.
\item Wrote a tester program, which stress-tested the program
performance on ``Smart TV''.
\item Wrote automated build for my project.
\item Wrote a sizable chunk of code dealing with usage statistic
aggregation using Google Analytics.
\end{itemize}
\end{description}

\subsection*{Rounds}
\label{sec-2-6}
\begin{description}
\item[{Programmer}] December 2010--August 2011
\begin{itemize}
\item Rewrote the communication part of the video chat application.
\item Wrote a testing server and utility programs for automated
testing.
\item Wrote a natural language processing program which was used
to advertise the company's product.
\end{itemize}
\end{description}

\section*{University Level Courses}
\label{sec-3}
Data Scientist's Toolbox (statistics in R), Statistics, Data
Analysis, Machine Learning, Artificial Intelligence.

\section*{Volunteering And Community Work}
\label{sec-4}
SCons project, ActionScript plugin.  (SCons is an extensible build system
written in Python).

For several years I was a member of Adobe Community Board. I moderated a forum
dedicated to Flash and ActionScript as well as writing some articles such as
this one: \url{http://kb2.adobe.com/community/publishing/526/cpsid_52670.html}

I'm an active member of Emacs Q/A site from the StackExchange family.

\section*{Examples Of My Work}
\label{sec-5}
My Github profile:
\begin{itemize}
\item \url{https://github.com/wvxvw/}.
\item \url{https://github.com/wvxvw-traiana/}.
\end{itemize}

\section*{Languages}
\label{sec-6}
Fluent in English, Hebrew, Russian.

\section*{Hobbies}
\label{sec-7}
NLP, Computational linguistics, Moral philosophy, General AI, Graphs.

\section*{Citizenship and Mobility}
\label{sec-8}
Citizen of Israel and Ukraine.  USA citizenship pending.  Willing
to relocate.
% Emacs 25.3.1 (Org mode 8.2.10)
\end{document}
